V1/Data/linkerd/120-2-wrk2-5xllc.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 18.520ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 17.787ms, rate sampling interval: 54ms
  Thread calibration: mean lat.: 53.510ms, rate sampling interval: 140ms
  Thread calibration: mean lat.: 52.919ms, rate sampling interval: 142ms
  Thread calibration: mean lat.: 53.805ms, rate sampling interval: 143ms
  Thread calibration: mean lat.: 53.729ms, rate sampling interval: 144ms
  Thread calibration: mean lat.: 52.924ms, rate sampling interval: 134ms
  Thread calibration: mean lat.: 54.844ms, rate sampling interval: 140ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.74ms   25.69ms 431.36ms   85.85%
    Req/Sec     4.98     28.61   377.00     96.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   40.29ms
 75.000%   47.33ms
 90.000%   55.65ms
 99.000%  101.76ms
 99.900%  430.08ms
 99.990%  431.10ms
 99.999%  431.61ms
100.000%  431.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.583     0.000000            1         1.00
      15.039     0.100000         1157         1.11
      21.615     0.200000         2312         1.25
      31.055     0.300000         3469         1.43
      36.895     0.400000         4624         1.67
      40.287     0.500000         5788         2.00
      41.791     0.550000         6371         2.22
      43.231     0.600000         6952         2.50
      44.575     0.650000         7527         2.86
      45.823     0.700000         8104         3.33
      47.327     0.750000         8675         4.00
      48.127     0.775000         8959         4.44
      48.767     0.800000         9248         5.00
      49.823     0.825000         9542         5.71
      51.327     0.850000         9826         6.67
      52.895     0.875000        10113         8.00
      54.047     0.887500        10258         8.89
      55.679     0.900000        10403        10.00
      57.471     0.912500        10546        11.43
      60.095     0.925000        10693        13.33
      64.031     0.937500        10835        16.00
      67.007     0.943750        10911        17.78
      69.055     0.950000        10981        20.00
      73.791     0.956250        11052        22.86
      76.223     0.962500        11125        26.67
      85.567     0.968750        11198        32.00
      86.655     0.971875        11232        35.56
      87.743     0.975000        11271        40.00
      89.023     0.978125        11306        45.71
      90.687     0.981250        11342        53.33
      91.967     0.984375        11378        64.00
      96.383     0.985938        11395        71.11
      99.839     0.987500        11413        80.00
     100.863     0.989062        11432        91.43
     102.143     0.990625        11449       106.67
     109.439     0.992188        11467       128.00
     117.311     0.992969        11476       142.22
     117.951     0.993750        11485       160.00
     118.975     0.994531        11494       182.86
     121.023     0.995313        11503       213.33
     138.751     0.996094        11512       256.00
     145.279     0.996484        11517       284.44
     156.799     0.996875        11521       320.00
     185.471     0.997266        11526       365.71
     211.199     0.997656        11530       426.67
     428.543     0.998047        11537       512.00
     428.543     0.998242        11537       568.89
     428.799     0.998437        11541       640.00
     429.055     0.998633        11544       731.43
     429.055     0.998828        11544       853.33
     430.335     0.999023        11546      1024.00
     430.591     0.999121        11550      1137.78
     430.591     0.999219        11550      1280.00
     430.591     0.999316        11550      1462.86
     430.847     0.999414        11551      1706.67
     431.103     0.999512        11556      2048.00
     431.103     0.999561        11556      2275.56
     431.103     0.999609        11556      2560.00
     431.103     0.999658        11556      2925.71
     431.103     0.999707        11556      3413.33
     431.103     0.999756        11556      4096.00
     431.103     0.999780        11556      4551.11
     431.103     0.999805        11556      5120.00
     431.103     0.999829        11556      5851.43
     431.103     0.999854        11556      6826.67
     431.103     0.999878        11556      8192.00
     431.103     0.999890        11556      9102.22
     431.103     0.999902        11556     10240.00
     431.615     0.999915        11557     11702.86
     431.615     1.000000        11557          inf
#[Mean    =       39.738, StdDeviation   =       25.689]
#[Max     =      431.360, Total count    =        11557]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12002 requests in 5.00m, 4.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 18000
Requests/sec:     39.99
Transfer/sec:     15.11KB