V1/Data/linkerd/1200-1-wrk2-r69cj.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 24.773ms, rate sampling interval: 75ms
  Thread calibration: mean lat.: 25.414ms, rate sampling interval: 81ms
  Thread calibration: mean lat.: 24.610ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 26.445ms, rate sampling interval: 97ms
  Thread calibration: mean lat.: 25.443ms, rate sampling interval: 90ms
  Thread calibration: mean lat.: 29.033ms, rate sampling interval: 83ms
  Thread calibration: mean lat.: 24.211ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 25.669ms, rate sampling interval: 83ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.92ms   21.81ms 386.82ms   92.57%
    Req/Sec    50.09     83.16   423.00     83.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.01ms
 75.000%   24.74ms
 90.000%   36.80ms
 99.000%  114.69ms
 99.900%  250.11ms
 99.990%  372.99ms
 99.999%  385.54ms
100.000%  387.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.663     0.000000            1         1.00
      11.551     0.100000        11600         1.11
      12.855     0.200000        23190         1.25
      14.247     0.300000        34772         1.43
      15.999     0.400000        46375         1.67
      18.015     0.500000        57916         2.00
      19.119     0.550000        63759         2.22
      20.303     0.600000        69542         2.50
      21.599     0.650000        75325         2.86
      22.991     0.700000        81077         3.33
      24.735     0.750000        86904         4.00
      25.807     0.775000        89773         4.44
      27.071     0.800000        92667         5.00
      28.575     0.825000        95559         5.71
      30.511     0.850000        98473         6.67
      33.023     0.875000       101364         8.00
      34.655     0.887500       102802         8.89
      36.799     0.900000       104250        10.00
      39.775     0.912500       105695        11.43
      45.215     0.925000       107137        13.33
      53.535     0.937500       108584        16.00
      58.271     0.943750       109309        17.78
      64.127     0.950000       110036        20.00
      71.743     0.956250       110757        22.86
      79.167     0.962500       111479        26.67
      86.911     0.968750       112205        32.00
      90.687     0.971875       112572        35.56
      93.823     0.975000       112928        40.00
      96.895     0.978125       113290        45.71
     100.671     0.981250       113660        53.33
     104.447     0.984375       114013        64.00
     106.559     0.985938       114197        71.11
     109.183     0.987500       114377        80.00
     112.191     0.989062       114557        91.43
     116.607     0.990625       114737       106.67
     122.559     0.992188       114918       128.00
     126.079     0.992969       115009       142.22
     129.855     0.993750       115099       160.00
     133.631     0.994531       115189       182.86
     138.111     0.995313       115280       213.33
     142.847     0.996094       115373       256.00
     145.407     0.996484       115417       284.44
     147.839     0.996875       115461       320.00
     150.271     0.997266       115507       365.71
     153.343     0.997656       115552       426.67
     159.231     0.998047       115597       512.00
     165.375     0.998242       115619       568.89
     173.183     0.998437       115642       640.00
     189.567     0.998633       115664       731.43
     216.447     0.998828       115687       853.33
     252.031     0.999023       115709      1024.00
     268.287     0.999121       115721      1137.78
     280.063     0.999219       115732      1280.00
     285.951     0.999316       115743      1462.86
     301.311     0.999414       115755      1706.67
     323.583     0.999512       115766      2048.00
     329.471     0.999561       115772      2275.56
     334.335     0.999609       115777      2560.00
     339.455     0.999658       115784      2925.71
     347.647     0.999707       115789      3413.33
     354.815     0.999756       115794      4096.00
     358.911     0.999780       115797      4551.11
     359.935     0.999805       115800      5120.00
     362.751     0.999829       115803      5851.43
     367.359     0.999854       115806      6826.67
     368.383     0.999878       115808      8192.00
     372.991     0.999890       115810      9102.22
     373.759     0.999902       115811     10240.00
     374.271     0.999915       115813     11702.86
     375.551     0.999927       115814     13653.33
     377.087     0.999939       115815     16384.00
     377.855     0.999945       115816     18204.44
     378.111     0.999951       115817     20480.00
     378.879     0.999957       115818     23405.71
     378.879     0.999963       115818     27306.67
     379.135     0.999969       115819     32768.00
     379.135     0.999973       115819     36408.89
     379.647     0.999976       115820     40960.00
     379.647     0.999979       115820     46811.43
     379.647     0.999982       115820     54613.33
     385.535     0.999985       115821     65536.00
     385.535     0.999986       115821     72817.78
     385.535     0.999988       115821     81920.00
     385.535     0.999989       115821     93622.86
     385.535     0.999991       115821    109226.67
     387.071     0.999992       115822    131072.00
     387.071     1.000000       115822          inf
#[Mean    =       23.918, StdDeviation   =       21.808]
#[Max     =      386.816, Total count    =       115822]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119958 requests in 5.00m, 44.27MB read
Requests/sec:    399.82
Transfer/sec:    151.10KB